In [181]:
import pymysql
import sqlalchemy as alch
from getpass import getpass
import pandas as pd

In [182]:
from getpass import getpass
password = getpass()

dbName = "sakila"

connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

In [183]:
# 1. How many copies of the film Hunchback Impossible exist in the inventory system?

query = """
SELECT count(inventory_id) AS count
FROM inventory
WHERE film_id IN (SELECT film_id 
                    FROM film 
                    WHERE title = "Hunchback Impossible");
"""

pd.read_sql_query(query, engine)

   count
0      6

In [184]:
# 2. List all films whose length is longer than the average of all the films.

query = """
SELECT title, length
FROM film
WHERE length > (SELECT AVG(length) FROM film)
"""

pd.read_sql_query(query, engine)

                title  length
0    AFFAIR PREJUDICE     117
1         AFRICAN EGG     130
2        AGENT TRUMAN     169
3     ALAMO VIDEOTAPE     126
4      ALASKA PHANTOM     136
..                ...     ...
484      WORST BANGER     185
485        WRATH MILE     176
486    WRONG BEHAVIOR     178
487    YOUNG LANGUAGE     183
488        YOUTH KICK     179

[489 rows x 2 columns]

In [185]:
# 3. Use subqueries to display all actors who appear in the film Alone Trip.

query = """
SELECT CONCAT(first_name, " ", last_name) AS actors
FROM actor
WHERE actor_id IN (SELECT actor_id 
                    FROM film_actor 
                    WHERE film_id IN (SELECT film_id 
                                        FROM film 
                                        WHERE title = "Alone Trip"))
"""

pd.read_sql_query(query, engine)

             actors
0          ED CHASE
1        KARL BERRY
2          UMA WOOD
3       WOODY JOLIE
4      SPENCER DEPP
5        CHRIS DEPP
6  LAURENCE BULLOCK
7        RENEE BALL

In [186]:
# 4. Sales have been lagging among young families, and you wish to target all family movies for a promotion. 
# Identify all movies categorized as family films.

query = """
SELECT title
FROM film
WHERE film_id IN (SELECT film_id
                    FROM film_category
                    WHERE category_id IN (SELECT category_id
                                            FROM category
                                            WHERE name = "Family"))
"""

pd.read_sql_query(query, engine)

               title
0        AFRICAN EGG
1      APACHE DIVINE
2     ATLANTIS CAUSE
3    BAKED CLEOPATRA
4          BANG KWAI
..               ...
64       SPLASH GUMP
65      SUNSET RACER
66     SUPER WYOMING
67  VIRTUAL SPOILERS
68      WILLOW TRACY

[69 rows x 1 columns]

In [187]:
# 5A. Get name and email from customers from Canada using subqueries.
# Do the same with joins. Note that to create a join, you will have to identify the correct tables with their primary keys
# and foreign keys, that will help you get the relevant information.

query = """
SELECT first_name, email
FROM customer
WHERE address_id IN (SELECT address_id
                        FROM address
                        WHERE city_id IN (SELECT city_id
                                            FROM city
                                            WHERE country_id IN (SELECT country_id
                                                                    FROM country
                                                                    WHERE country = "Canada")))
"""

pd.read_sql_query(query, engine)

  first_name                                 email
0    DERRICK    DERRICK.BOURQUE@sakilacustomer.org
1    DARRELL      DARRELL.POWER@sakilacustomer.org
2    LORETTA  LORETTA.CARPENTER@sakilacustomer.org
3     CURTIS        CURTIS.IRBY@sakilacustomer.org
4       TROY       TROY.QUIGLEY@sakilacustomer.org

In [188]:
# 5B. Get name and email from customers from Canada using subqueries.
# Do the same with joins. Note that to create a join, you will have to identify the correct tables with their primary keys
# and foreign keys, that will help you get the relevant information.

query = """
SELECT customer.first_name, customer.email
FROM country
JOIN city on country.country_id=city.country_id
JOIN address on city.city_id=address.city_id 
JOIN customer on address.address_id=customer.address_id
WHERE country = "Canada"
"""

pd.read_sql_query(query, engine)

  first_name                                 email
0    DERRICK    DERRICK.BOURQUE@sakilacustomer.org
1    DARRELL      DARRELL.POWER@sakilacustomer.org
2    LORETTA  LORETTA.CARPENTER@sakilacustomer.org
3     CURTIS        CURTIS.IRBY@sakilacustomer.org
4       TROY       TROY.QUIGLEY@sakilacustomer.org

In [189]:
# 6. Which are films starred by the most prolific actor? Most prolific actor is defined as the actor that has acted
# in the most number of films. First you will have to find the most prolific actor and then use that actor_id
# to find the different films that he/she starred.

query = """
SELECT title
FROM film
WHERE film_id IN (SELECT film_id
                    FROM film_actor
                    WHERE actor_id IN (SELECT actor_id
                                        FROM (SELECT actor_id, COUNT(film_id) AS count
                                                FROM film_actor
                                                GROUP BY actor_id
                                                ORDER BY count DESC
                                                LIMIT 1) AS actor_id))
"""

pd.read_sql_query(query, engine)

                      title
0              BED HIGHBALL
1         CALENDAR GUNFIGHT
2           CHAMBER ITALIAN
3           CHAPLIN LICENSE
4       CHARIOTS CONSPIRACY
5           CLUELESS BUCKET
6       COLDBLOODED DARLING
7         CONEHEADS SMOOCHY
8              DARKNESS WAR
9            DEER VIRGINIAN
10             DOGMA FAMILY
11          ELEPHANT TROJAN
12           EXCITEMENT EVE
13           FRISCO FORREST
14              GANDHI KWAI
15        GOODFELLAS SALUTE
16            GUNFIGHT MOON
17             HALL CASSIDY
18     HEARTBREAKERS BRIGHT
19            HOOK CHARIOTS
20              HYDE DOCTOR
21           IMPACT ALADDIN
22              INDIAN LOVE
23           INTRIGUE WORST
24          LICENSE WEEKEND
25          LOUISIANA HARRY
26       MAGNIFICENT CHITTY
27         METAL ARMAGEDDON
28        MIDNIGHT WESTWARD
29        MOVIE SHAKESPEARE
30          MUMMY CREATURES
31             OPEN AFRICAN
32           SEARCHERS WAIT
33              SEVEN SWARM
34            SIERRA DIVIDE
35      SPIRITED CASUALTIES
36          STORM HAPPINESS
37              SUGAR WONKA
38         TELEGRAPH VOYAGE
39  TRAINSPOTTING STRANGERS
40                WIFE TURN
41              WINDOW SIDE

In [190]:
# 7. Films rented by most profitable customer. You can use the customer table and payment table to find
# the most profitable customer ie the customer that has made the largest sum of payments.

query = """
SELECT title
FROM film
WHERE film_id IN (SELECT film_id
                        FROM inventory
                        WHERE inventory_id IN (SELECT inventory_id
                                                FROM rental
                                                WHERE customer_id IN (SELECT customer_id
                                                                        FROM (SELECT customer_id, SUM(amount) as total
                                                                                FROM payment
                                                                                GROUP BY customer_id
                                                                                ORDER BY total DESC
                                                                                LIMIT 1) as cutomer)))
"""

pd.read_sql_query(query, engine)

                    title
0        DESTINY SATURDAY
1          CYCLONE FAMILY
2              SLUMS DUCK
3          FIDELITY DEVIL
4             SPLASH GUMP
5       MISSION ZOOLANDER
6        MULHOLLAND BEAST
7          PRINCESS GIANT
8           PARIS WEEKEND
9               RACER EGG
10         WEDDING APOLLO
11       BIKINI BORROWERS
12         ROBBERY BRIGHT
13               SPY MILE
14        MOONWALKER FOOL
15       METAL ARMAGEDDON
16    RIDGEMONT SUBMARINE
17            HIGH ENCINO
18           DURHAM PANKY
19            GANGS PRIDE
20             DATE SPEED
21     HEAVYWEIGHTS BEAST
22             DUMBO LUST
23        GOLDMINE TYCOON
24       ENGLISH BULWORTH
25    BRINGING HYSTERICAL
26  FORRESTER COMANCHEROS
27        REAP UNFAITHFUL
28           DESIRE ALIEN
29        LONELY ELEPHANT
30          BETRAYED REAR
31       SINNERS ATLANTIS
32               INCH JET
33       FOOL MOCKINGBIRD
34         BLUES INSTINCT
35         REMEMBER DIARY
36          INSECTS STONE
37         PICKUP DRIVING
38        TERMINATOR CLUB
39          MASSAGE IMAGE
40            MILLION ACE
41        QUEST MUSSOLINI
42       NOVOCAINE FLIGHT
43         STING PERSONAL

In [191]:
# 8. Get the client_id and the total_amount_spent of those clients who spent more 
# than the average of the total_amount spent by each client.

query = """
SELECT customer_id, SUM(amount) AS total
FROM payment
GROUP BY customer_id
HAVING SUM(amount) > (SELECT AVG(total)
                        FROM (SELECT customer_id, SUM(amount) AS total
                                FROM payment
                                GROUP BY customer_id) as total);
"""

pd.read_sql_query(query, engine)

     customer_id   total
0              1  118.68
1              2  128.73
2              3  135.74
3              5  144.62
4              7  151.67
..           ...     ...
280          590  112.75
281          591  134.73
282          593  113.74
283          594  130.73
284          595  117.70

[285 rows x 2 columns]